<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
   <title>&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#20351;&#29992;&#38053;&#21273;</title><link rel="stylesheet" type="text/css" href="themes/default/style/style.css"><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"><style type="text/css">
body { background-image: url('themes/default/style/draft.png');
       background-repeat: no-repeat;
       background-position: top left;
       /* The following properties make the watermark "fixed" on the page. */
       /* I think that's just a bit too distracting for the reader... */
       /* background-attachment: fixed; */
       /* background-position: center center; */
     }</style><link rel="home" href="index.html" title="GnuPG(gpg)&#20351;&#29992;&#25351;&#21335;"><link rel="up" href="index.html" title="GnuPG(gpg)&#20351;&#29992;&#25351;&#21335;"><link rel="prev" href="ch02s04.html" title="4.&nbsp;&#23433;&#35013;"><link rel="next" href="ch03s02.html" title="2.&nbsp;&#36755;&#20986;&#38053;&#21273;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#20351;&#29992;&#38053;&#21273;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch02s04.html"><img src="themes/default/navig/prev.png" alt="&#19978;&#19968;&#39029;"></a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch03s02.html"><img src="themes/default/navig/next.png" alt="&#19979;&#19968;&#39029;"></a></td></tr></table></div><div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d0e419"></a>&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#20351;&#29992;&#38053;&#21273;</h1></div></div></div><div class="toc"><p><b>&#30446;&#24405;</b></p><dl class="toc"><dt><span class="sect1"><a href="ch03.html#d0e422">1. &#20135;&#29983;&#38053;&#21273;</a></span></dt><dt><span class="sect1"><a href="ch03s02.html">2. &#36755;&#20986;&#38053;&#21273;</a></span></dt><dt><span class="sect1"><a href="ch03s03.html">3. &#24341;&#36827;&#38053;&#21273;</a></span></dt><dt><span class="sect1"><a href="ch03s04.html">4. &#21462;&#28040;&#38053;&#21273;</a></span></dt><dt><span class="sect1"><a href="ch03s05.html">5. &#38053;&#21273;&#31649;&#29702;</a></span></dt><dt><span class="sect1"><a href="ch03s06.html">6. &#38053;&#21273;&#31614;&#21517;</a></span></dt></dl></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e422"></a>1.&nbsp;&#20135;&#29983;&#38053;&#21273;</h2></div></div></div><p>&#20351;&#29992;&#20197;&#19979;&#21629;&#20196;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="command"><strong>gpg --gen-key</strong></span></p></blockquote></div><p>&#20197;&#20135;&#29983;&#19968;&#20010;&#26032;&#30340;&#38053;&#21273;&#23545;&#65288;&#19968;&#20010;&#38053;&#21273;&#23545;&#21253;&#25324;&#19968;&#25226;&#38544;&#23494;&#38053;&#21273;&#21644;&#30456;&#24212;&#30340;&#19968;&#25226;&#20844;&#24320;&#38053;&#21273;&#65289;&#12290;&#36816;&#34892;&#26102;&#65292;&#31532;&#19968;&#20010;&#38382;&#39064;&#26159;&#36873;&#25321;&#20351;&#29992;&#21738;&#20010;&#31639;&#27861;&#12290;&#20320;&#21487;&#20197;&#22312; PGP DH vs. RSA FAQ(http://www.hertreg.ac.uk/ss/pgpfaq.html) &#25110; Applied Cryptography (http://www.gnupg.org/(en)/howtos/ch/GPGMiniHowto-6.html#BSchneier)&#20013;&#35835;&#21040;&#26356;&#22810;&#31639;&#27861;&#26041;&#38754;&#30340;&#20449;&#24687;&#12290;&#23545;&#36825;&#20010;&#38382;&#39064;&#21487;&#20197;&#24456;&#23481;&#26131;&#22320;&#36873;&#25321;DSA/ElGamal&#12290;&#35813;&#31639;&#27861;&#27809;&#26377;&#19987;&#21033;&#12290;</p><p>&#19979;&#19968;&#20010;&#38382;&#39064;&#26159;&#38053;&#21273;&#38271;&#24230;&#12290;&#23545;&#36825;&#20010;&#38382;&#39064;&#30340;&#31572;&#26696;&#22240;&#20154;&#32780;&#24322;&#12290;&#20320;&#38656;&#35201;&#22312;&#23433;&#20840;&#21644;&#35745;&#31639;&#26102;&#38388;&#20108;&#32773;&#36873;&#19968;&#12290;&#22914;&#26524;&#38053;&#21273;&#38271;&#20123;&#65292;&#35759;&#24687;&#34987;&#25130;&#33719;&#21518;&#34987;&#30772;&#35299;&#30340;&#39118;&#38505;&#23601;&#23567;&#20123;&#12290;&#20294;&#26159;&#20351;&#29992;&#26102;&#35745;&#31639;&#26102;&#38388;&#20063;&#35201;&#38271;&#20123;&#12290;&#22914;&#26524;&#35745;&#31639;&#26102;&#38388;&#26159;&#32771;&#34385;&#30340;&#37325;&#35201;&#22240;&#32032;&#65292;&#20320;&#20173;&#28982;&#24212;&#35813;&#32771;&#34385;&#21040;&#20320;&#23558;&#20351;&#29992;&#36825;&#25226;&#38053;&#21273;&#19968;&#27573;&#26102;&#38388;&#12290;&#25105;&#20204;&#37117;&#30693;&#36947;&#30001;&#20110;&#26032;&#22788;&#29702;&#22120;&#36234;&#26469;&#36234;&#24555;&#65292;&#20351;&#24471;&#25968;&#20540;&#35745;&#31639;&#36895;&#24230;&#22686;&#21152;&#38750;&#24120;&#24555;&#12290;&#22240;&#27492;&#65292;&#36873;&#25321;&#38053;&#21273;&#38271;&#24230;&#26102;&#65292;&#35201;&#32771;&#34385;&#21040;&#36825;&#20010;&#22240;&#32032;&#12290;GnuPG&#35201;&#27714;&#30340;&#26368;&#30701;&#38053;&#21273;&#38271;&#24230;&#26159;768&#23383;&#20301;&#12290;&#19981;&#36807;&#65292;&#26377;&#20154;&#35748;&#20026;&#20320;&#24212;&#35813;&#20351;&#29992;2048&#20301;&#30340;&#38053;&#21273;&#65288;&#36825;&#23454;&#38469;&#20063;&#26159;GnuPG&#30446;&#21069;&#20801;&#35768;&#30340;&#26368;&#22823;&#38271;&#24230;&#65289;&#12290;&#23601;DSA&#32780;&#35328;&#65292;1024&#20301;&#26159;&#19968;&#20010;&#26631;&#20934;&#30340;&#38271;&#24230;&#12290;&#24403;&#23433;&#20840;&#26159;&#39318;&#35201;&#32771;&#34385;&#22240;&#32032;&#32780;&#36895;&#24230;&#30456;&#23545;&#27425;&#35201;&#26102;&#65292;&#20320;&#24212;&#35813;&#36873;&#29992;&#26368;&#22823;&#21487;&#33021;&#30340;&#38271;&#24230;&#12290;</p><p>&#31243;&#24207;&#29616;&#22312;&#35201;&#20320;&#36755;&#20837;&#20320;&#30340;&#21517;&#23383;&#65292;&#20171;&#32461;&#21644;&#30005;&#23376;&#37038;&#20214;&#22320;&#22336;&#12290;&#23494;&#30721;&#23558;&#26681;&#25454;&#20197;&#19978;&#36755;&#20837;&#30340;&#20869;&#23481;&#20135;&#29983;&#20986;&#26469;&#12290;&#20320;&#21487;&#20197;&#22312;&#23558;&#26469;&#25913;&#21464;&#36825;&#20123;&#35774;&#32622;&#12290;&#35265;&#38053;&#21273;&#31649;&#29702;&#12290;&#20320;&#24212;&#35813;&#29992;&#19968;&#20010;&#36739;&#38271;&#30340;&#30495;&#23454;&#30340;&#30005;&#23376;&#37038;&#20214;&#22320;&#22336;&#65292;&#22240;&#20026;&#20197;&#19978;&#23436;&#25972;&#30340;&#29992;&#25143;&#36523;&#20221;&#35782;&#21035;&#65288;&#21253;&#25324;&#21517;&#23383;&#65292;&#20171;&#32461;&#21644;&#30005;&#23376;&#37038;&#20214;&#22320;&#22336;&#65289;&#37117;&#34987;&#31614;&#21517;&#12290;&#22914;&#26524;&#20320;&#20462;&#25913;&#20102;&#22320;&#22336;&#65292;&#31614;&#21517;&#23601;&#23558;&#19982;&#20462;&#25913;&#21518;&#30340;&#20869;&#23481;&#19981;&#31526;&#12290;&#26368;&#21518;&#19968;&#28857;&#65292;&#20320;&#21487;&#20197;&#36755;&#20837;&#19968;&#20123;&#20171;&#32461;&#24615;&#20869;&#23481;&#12290;&#22312;&#27492;&#20320;&#36755;&#20837;&#20160;&#20040;&#37117;&#34892;&#65292;&#21487;&#20197;&#30456;&#24403;&#26377;&#29992;&#12290;</p><p>&#26368;&#21518;&#65292;&#20320;&#24471;&#25970;&#20837;&#23494;&#30721;&#65292;&#25110;&#31216;&#36890;&#34892;&#23383;&#65288;&#23454;&#38469;&#19978;&#65292;&#30001;&#20110;&#20801;&#35768;&#20351;&#29992;&#31354;&#26684;&#65292;&#21483;&#20316;&#36890;&#34892;&#21477;&#26356;&#21512;&#36866;&#65289;&#12290;&#35813;&#23494;&#30721;&#20351;&#20320;&#21487;&#20197;&#20351;&#29992;&#19982;&#20320;&#30340;&#23494;&#38053;&#26377;&#20851;&#30340;&#21508;&#39033;&#21151;&#33021;&#12290;&#19968;&#20010;&#22909;&#30340;&#36890;&#34892;&#21477;&#20855;&#26377;&#19979;&#21015;&#35201;&#32032;&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem"><p>&#38271;&#24230;&#35201;&#38271;&#65292;</p></li><li class="listitem"><p>&#21253;&#21547;&#29305;&#27530;&#23383;&#31526;&#65288;&#38750;&#33521;&#25991;&#23383;&#27597;&#25110;&#38463;&#25289;&#20271;&#25968;&#23383;&#65289;&#65292;</p></li><li class="listitem"><p>&#35201;&#26159;&#26576;&#31181;&#29305;&#27530;&#30340;&#19996;&#35199;&#65288;&#19981;&#33021;&#26159;&#22995;&#21517;&#65289;&#65292;</p></li><li class="listitem"><p>&#35201;&#24456;&#38590;&#34987;&#29468;&#21040;&#65288;&#22240;&#27492;&#35831;&#19975;&#21247;&#20351;&#29992;&#22995;&#21517;&#65292;&#29983;&#26085;&#65292;&#30005;&#35805;&#21495;&#30721;&#65292;&#20449;&#29992;&#21345;&#21495;&#30721;&#65292;&#25903;&#31080;&#24080;&#21495;&#21495;&#30721;&#65292;&#23567;&#23401;&#30340;&#22995;&#21517;&#25110;&#20154;&#25968;&#31561;&#65289;</p></li></ul></div><p>
</p><p>&#22312;&#36890;&#34892;&#21477;&#20013;&#65292;&#29992;&#22823;&#23567;&#20889;&#28151;&#26434;&#30340;&#26041;&#24335;&#20320;&#21487;&#20197;&#36827;&#19968;&#27493;&#22686;&#36827;&#23433;&#20840;&#12290;&#24403;&#20320;&#24819;&#20986;&#23494;&#30721;&#26102;&#65292;&#19968;&#23450;&#35201;&#20445;&#35777;&#20320;&#19981;&#20250;&#24536;&#25481;&#23427;&#12290;&#22914;&#26524;&#20320;&#24536;&#25481;&#20102;&#65292;&#21457;&#32473;&#20320;&#30340;&#35759;&#24687;&#23601;&#20877;&#20063;&#27809;&#27861;&#35299;&#23494;&#22240;&#32780;&#20877;&#20063;&#27809;&#27861;&#35835;&#20102;&#65292;&#20320;&#30340;&#23494;&#38053;&#20063;&#20877;&#20063;&#29992;&#19981;&#25104;&#20102;&#12290;&#20135;&#29983;&#21253;&#21547;&#36825;&#20010;&#20449;&#24687;&#30340;&#26576;&#31181;&#24418;&#24335;&#30340;&#35777;&#20070;&#21487;&#33021;&#26159;&#19968;&#31181;&#26126;&#26234;&#20043;&#20030;&#12290;&#65288;&#24403;&#28982;&#35201;&#23567;&#24515;&#19981;&#35201;&#35753;&#21035;&#20154;&#24471;&#21040;&#20320;&#30340;&#36890;&#34892;&#21477;&#65289;&#12290;&#35265;&#21462;&#28040;&#38053;&#21273;.</p><p>&#22312;&#19978;&#36848;&#25152;&#26377;&#37117;&#36755;&#20837;&#20043;&#21518;&#65292;&#31995;&#32479;&#24320;&#22987;&#20135;&#29983;&#38053;&#21273;&#12290;&#36825;&#20250;&#33457;&#19968;&#20123;&#26102;&#38388;&#12290;&#22312;&#36825;&#27573;&#26102;&#38388;&#65292;&#23427;&#38656;&#35201;&#25910;&#38598;&#35768;&#22810;&#38543;&#26426;&#25968;&#25454;&#12290;&#22914;&#26524;&#20320;&#22312;&#36825;&#27573;&#26102;&#38388;&#22312;&#21478;&#19968;&#20010;&#31383;&#21475;&#24037;&#20316;&#65292;&#20320;&#23601;&#21487;&#20197;&#24110;&#21161;&#31995;&#32479;&#25910;&#38598;&#38543;&#26426;&#25968;&#25454;&#12290;&#27491;&#22914;&#20320;&#29616;&#22312;&#24050;&#32463;&#25026;&#24471;&#30340;&#65292;&#20135;&#29983;&#20986;&#30340;&#38053;&#21273;&#24635;&#26159;&#19981;&#21516;&#30340;&#12290;&#22914;&#26524;&#20320;&#22312;&#29616;&#22312;&#21644;&#20116;&#20998;&#38047;&#21518;&#36755;&#20837;&#23436;&#20840;&#30456;&#21516;&#30340;&#25968;&#25454;&#26469;&#20135;&#29983;&#38053;&#21273;&#65292;&#20320;&#20250;&#24471;&#21040;&#20004;&#25226;&#19981;&#21516;&#30340;&#38053;&#21273;&#12290;&#29616;&#22312;&#20320;&#19968;&#23450;&#26126;&#30333;&#20026;&#20160;&#20040;&#20320;&#19981;&#24212;&#35813;&#24536;&#35760;&#20320;&#30340;&#36890;&#34892;&#21477;&#20102;&#12290; </p></div></div><div class="navfooter"><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch02s04.html"><img src="themes/default/navig/prev.png" alt="&#19978;&#19968;&#39029;"></a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch03s02.html"><img src="themes/default/navig/next.png" alt="&#19979;&#19968;&#39029;"></a></td></tr><tr><td width="40%" align="left" valign="top">4.&nbsp;&#23433;&#35013;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html"><img src="themes/default/navig/home.png" alt="&#36215;&#22987;&#39029;"></a></td><td width="40%" align="right" valign="top">&nbsp;2.&nbsp;&#36755;&#20986;&#38053;&#21273;</td></tr></table></div></body></html>